console.log(1111);

/* 
자바스크립트란 
 - 웹 페이지의 동적인 기능을 구현하기 위해
   만들어진 언어입니다.
   es5 es6 ...

   console.log();
   - 콘솔 화면에 메세지를 출력한다.
   alert
   - 브라우저에 경고창을 띄웁니다.

   숫자표현 - 12345
   문자표현 - '안녕하세요'
   명령문의 끝 - 세미콜론(;)을 붙여줘야한다.

   변수
   - 다양한 값을 저장한다.

   let name = "정성인";
   - let은 예약어(키워드)라고 불리며 문법적인 용도로 사용되고 있기 때문에
     식별자로 사용할 수 없다. let, const, funtion 등 많은 예약어가 있다.
   - name은 식별자라고 불리며 이름을 붙일때 사용한다.

   함수
   - 코드를 편하게 사용하기 위해 그룹화한 것을 말한다.
   - 객체안에 쓰이는 함수를 메서드라고 한다.

   객체
   - 변수와 함수를 가진다.
   - 객체안에 쓰이는 변수를 프로퍼티(속성)이라고 한다.

   이벤트
   - HTML 요소에서 발생한 사건



*/

